Revit 2027 API
ParameterTypeId.AlwaysZeroLength Property
 "Base Offset"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId AlwaysZeroLength { get; }
Public Shared ReadOnly Property AlwaysZeroLength As ForgeTypeId
	Get
public:
static property ForgeTypeId^ AlwaysZeroLength {
	ForgeTypeId^ get ();
}
static member AlwaysZeroLength : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace